import React from "react";
import "./About.css";

import aboutImage1 from "../../assets/about1.png";

function About() {
  return (
    <section className="about-container">
      <h1 className="about-title">ประวัติความเป็นมา</h1>
      <div className="content-container">
        <div className="img-content">
          <img src={aboutImage1} alt="about-picture" />
        </div>

        <div className="content">
          <h1>วัดพระธาตุดอยสุเทพราชวรวิหาร</h1>
          <p className="content-text">
            วัดพระธาตุดอยสุเทพราชวรวิหาร (คำเมือง: ) พระอารามหลวง ชั้นโท
            ชนิดราชวรวิหาร ตั้งอยู่ในอุทยานแห่งชาติดอยสุเทพ-ปุย
            วัดมีความสูงจากระดับที่ราบเชียงใหม่ราว 689 เมตร
            และมีความสูงจากระดับน้ำทะเลปานกลาง 1,046 เมตร
            เป็นหนึ่งในวัดที่มีความสำคัญมากที่สุดของจังหวัดเชียงใหม่
            นอกจากนี้ยังประกอบด้วยจุดชมทิวทัศน์ที่สามารถมองเห็นเมืองเชียงใหม่ได้ทั้งหมด
            <br />
            <br />
            พ.ศ. 1912
            พญากือนาได้นิมนต์พระสุมนเถระมาเผยแผ่พระพุทธศาสนายังเมืองเชียงใหม่
            พระสุมนเถระได้อัญเชิญพระบรมสารีริกธาตุที่ค้นพบ ณ เมืองปางจา
            (บางขลัง) มาด้วย แต่พญากือนาให้พำนักที่วัดพระยืนก่อน
            เมื่อสร้างวัดสวนดอก เสร็จใน พ.ศ. 1914
            จึงนิมนต์พระสุมนเถระมาจำพรรษาที่วัดสวนดอก
            พระบรมสารีริกธาตุได้แสดงปาฏิหาริย์แยกเป็น 2 องค์
            จึงเชิญพระบรมสารีริกธาตุหนึ่งองค์บรรจุในพระเจดีย์วัดสวนดอก
          </p>
        </div>
      </div>
      <hr />
    </section>
  );
}

export default About;
