import React from "react";
import "./Blog.css";

import blog1 from "../../assets/blog1.png";
import blog3 from "../../assets/blog3.png";
import blog2 from "../../assets/blog4.png";

function Blog() {
  return (
    <section className="blog-section">
      <div className="blog-heading">
        <span>My Recent Posts</span>
        <h3>My Blog</h3>
      </div>

      <div className="blog-container">
        <div className="blog-box">
          <div className="blog-img">
            <img src={blog1} alt="blog" />
          </div>

          <div className="blog-text">
            <span>
              18 July 2023 <br /> พีธีมอบรางวัลผู้นำบุญ ครั้งที่ 3
            </span>

            <p>
              ขอเชิญร่วมงานฉลองปริญญาดุษฎีบัณฑิต, ปริญญาดุษฎีบัณฑิตกิตติมศักดิ์
              รางวัลเสาเสมาธรรมจักร, รางวัลเสาอโศก พระครูวิเทศกัลยาณธรรม, ดร.
              และอุบาสก อุบาสิกา ผู้ได้รับรางวัลดังกล่าว วันอาทิตย์ที่ 5
              เดือนมิถุนายน พ.ศ. 2565 ตั้งแต่เวลา 10.30 น. เป็นต้นไป
              ร่วมทำบุญตักบาตร ถวายภัตตาหารเพล โรงทานฟรี ถวายมหาสังฆทาน
              ทอดผ้าป่าสามัคคีสร้างโบสถ์ มอบรางวัลผู้นำบุญ
              ชมการแสดงของนักเรียนโรงเรียนพุทธศาสนาวันอาทิตย์
              เลือกซื้ออาหารคาวหวาน มากมาย ตามวัน เวลา ดังกล่าว
              โดยพร้อมเพรียงกัน ขออนุโมทนาบุญมา ณ โอกาสนี้
            </p>
            <div className="blog-bottom">
              <a href="/">ข้อมูลเพิ่มเติม คลิ้ก!!</a>
            </div>
          </div>
        </div>

        <div className="blog-box">
          <div className="blog-img">
            <img src={blog2} alt="blog" />
          </div>

          <div className="blog-text">
            <span>
              ขอเชิญร่วมทำบุญอายุวัฒนมงคล 73 ปี <br />
              วันอาทิตย์ที่ 19 มีนาคม 2566 ตั้งแต่เวลา 09.30 น.
            </span>

            <p>
              ร่วมทำบุญตักบาตร ถวายภัตตาหารเพล ถวายมหาสังฆทาน
              ทอดผ้าป่าสามัคคีสร้างโบสถ์ แจกข้าวสาร-อาหารแห้ง เครื่องใช้ต่างๆ
              ชมการแสดงของโรงเรียนพุทธศาสนาวันอาทิตย์
              และเลือกซื้ออาหารคาวหวานมากมาย ตามวัน เวลา ดังกล่าว
              โดยพร้อมเพรียงกัน ขออนุโมทนาบุญมา ณ โอกาสนี้ สอบถามได้ที่ Tel:
              909-606-9502
            </p>
            <div className="blog-bottom">
              <a href="/">ข้อมูลเพิ่มเติม คลิ้ก!!</a>
            </div>
          </div>
        </div>

        <div className="blog-box">
          <div className="blog-img">
            <img src={blog3} alt="blog" />
          </div>

          <div className="blog-text">
            <span>ขอเชิญร่วมงานทำบุญทอดกฐินประทาน สมเด็จพระสังฆราช</span>

            <p>
              ขอเชิญร่วมงานฉลองปริญญาดุษฎีบัณฑิต, ปริญญาดุษฎีบัณฑิตกิตติมศักดิ์
              รางวัลเสาเสมาธรรมจักร, รางวัลเสาอโศก พระครูวิเทศกัลยาณธรรม, ดร.
              และอุบาสก อุบาสิกา ผู้ได้รับรางวัลดังกล่าว วันอาทิตย์ที่ 5
              เดือนมิถุนายน พ.ศ. 2565 ตั้งแต่เวลา 10.30 น. เป็นต้นไป
              ร่วมทำบุญตักบาตร ถวายภัตตาหารเพล โรงทานฟรี ถวายมหาสังฆทาน
              ทอดผ้าป่าสามัคคีสร้างโบสถ์ มอบรางวัลผู้นำบุญ
              ชมการแสดงของนักเรียนโรงเรียนพุทธศาสนาวันอาทิตย์
              เลือกซื้ออาหารคาวหวาน มากมาย ตามวัน เวลา ดังกล่าว
              โดยพร้อมเพรียงกัน ขออนุโมทนาบุญมา ณ โอกาสนี้
            </p>
            <div className="blog-bottom">
              <a href="/">ข้อมูลเพิ่มเติม คลิ้ก!!</a>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
}

export default Blog;
